YafhersLab/STM32_Codes/SPI/Core/Src/main.c
	//6. Habilitamos el ADC
	ADC1 -> CR2 |= ADC_CR2_ADON;																		//habilitamos el ADC
	ADC1 -> CR2 |= ADC_CR2_SWSTART;																		//no hace conversión ya que usaremos external trigger

#if 1
	//7. Configuramos la interrupcion del ADC
	NVIC_EnableIRQ(ADC_IRQn);

	//8. Configuramos el External Trigger TIM3 (DESACTIVAR PARA POLLING)
	RCC -> APB1ENR |= RCC_APB1ENR_TIM3EN;																//habilitamos el reloj del timer
	TIM3 -> CR1 = 0;																					//limpiamos el registro CR1 del TIM3
	/*
	 * Calculamos ARR para una frecuencia de 50Hz
	 * ARR = 16E+6 / ((80) * (50)) - 1
	 * ARR = 399
	 * PSC = 79
	 */
	TIM3 -> ARR = 400 - 1;																				//establezco mi ARR para 50 Hz
	TIM3 -> PSC = 80 - 1;																				//establezco mi PSC para 50 Hz
	TIM3 -> CR2 = TIM_CR2_MMS_1;																		//usamos el Update Event
	TIM3 -> CR1 |= TIM_CR1_CEN;																			//iniciar el conteo del tim
#endif
}

void ADC_ConfigDMA(void){
	RCC -> APB2ENR |= RCC_APB2ENR_ADC1EN;																//habilito el reloj del ADC1
	ADC1 -> CR1 |= ADC_CR1_SCAN;																		//activo el modo scan para usar varios canales
	ADC1 -> CR2 |= (ADC_CR2_CONT | ADC_CR2_ADON | ADC_CR2_DMA);											//activo el ADC, el contador y el DMA
	ADC1 -> SQR1 |= (2 << ADC_SQR1_L_Pos);																//selecciono el numero de canales a convertir (3)
	ADC1 -> SQR3 |= (1 << ADC_SQR3_SQ1_Pos);															//asigno el canal 1 como primero en convertir
	ADC1 -> SQR3 |= (2 << ADC_SQR3_SQ2_Pos);															//asgino el canal 2 como segundo en convertir
	ADC1 -> SQR3 |= (3 << ADC_SQR3_SQ3_Pos);															//asigno el canal 3 como tercero en convertir
}

void DMA_Config(void){
	//1. Habilitamos el reloj del DMA
	RCC -> AHB1ENR |= RCC_AHB1ENR_DMA2EN;																//habilito el reloj de mi DMA2

	//2. Configuramos el modo de transferencia del DMA
	DMA2_Stream0 -> CR &=~ DMA_SxCR_DIR;																//trasferencia de periferico a memoria
	DMA2_Stream0 -> PAR = (uint32_t)&ADC1->DR;															//asigno la dirección del periferico
	DMA2_Stream0 -> M0AR = (uint32_t)adc_values;														//asigno la dirección de la memoria
	//DMA2_Stream0 -> NDTR = size;																		//configuro el numero total de datos a transferir

	//3. Configuramos el registro de Control del DMA
	DMA2_Stream0 -> CR = 0;																				//limpiamos el registro de control
	DMA2_Stream0 -> CR |= DMA_SxCR_PL_0;																//prioridad alta
	DMA2_Stream0 -> CR |= DMA_SxCR_DIR_0;																//direccion de transferencia de datos
	DMA2_Stream0 -> CR |= DMA_SxCR_CIRC;																//habilito el modo circular
	DMA2_Stream0 -> CR |= DMA_SxCR_PINC | DMA_SxCR_MINC;												//configuro el modo de periferico y memoria incrementada
	DMA2_Stream0 -> CR |= DMA_SxCR_PSIZE_0 | DMA_SxCR_MSIZE_0;											//configuro el tamaño de los datos de la memoria y los periferico a 16 bits

	//4. Configuramos las interrupciones
	DMA2_Stream0 -> CR |= DMA_SxCR_TCIE;																//interrupciones para la transmision completada
	NVIC_EnableIRQ(DMA2_Stream0_IRQn);																	//habilito la interrupcion en la NVIC

	//5. Configuro el periferico que utilizare para el DMA
	DMA2_Stream0 -> CR &=~ DMA_SxCR_CHSEL;																//selecciono el ADC1

	//6. Habilito el DMA
	DMA2_Stream0 -> CR |= DMA_SxCR_EN;
}

//conversion por polling (desventaja: genera un bloqueo)
uint16_t ADC_getData(uint8_t ch){
	ADC1 -> SQR1 &=~ ADC_SQR1_L;																		//indicar que haremos una unica conversion
	ADC1 -> SQR3 = ch;																					//indica el canal que se va a convertir
	ADC1 -> CR2 |= ADC_CR2_SWSTART;																		//hago un disparo por software (polling)
	while(!(ADC1 -> SR & ADC_SR_EOC));																	//espero a que se termine la conversion
	return ADC1 -> DR;																					//retorno el valor convertido
}

uint32_t getTicks(){
	return uwTicks;
}

void USART2_putc(char ch){
	while(!(USART2 -> SR & USART_SR_TXE));
	USART2 -> DR = ch;
}

char USART2_getc(void){
	while(!(USART2 -> SR & USART_SR_RXNE));
	return USART2 -> DR;
}

uint8_t button_read(uint8_t current){
	static uint32_t ticks = 0;
	static uint8_t lastState = 1;	//1 pull up, 0 pull down
	//filtrado
	if((getTicks() - ticks) > 20){		//el 20 es opcional
		ticks = getTicks();
		if(lastState != current){
			lastState = current;
			if(current == 0){			//flanco ascendente
				printf("3\n");
				return 0;
			}
		}
	}
	return 1;
}

void SPI1_Config(void){
	// 1. Configuramos los pines GPIO
	RCC -> AHB1ENR |= GPIOX_CLOCK(SPI1_SCK) | GPIOX_CLOCK(SPI1_NSS);							// activar el reloj del SPI1_SCK y NSS
	GPIOX_MODER(MODE_ALTER, SPI1_SCK);															// funcion alternativa del SCK
	GPIOX_MODER(MODE_ALTER, SPI1_MOSI);															// funcion alternativa del MOSI
	GPIOX_MODER(MODE_ALTER, SPI1_MISO);															// funcion alternativa del MISO
	GPIOX_MODER(MODE_OUT, SPI1_NSS);															// pin NSS como salida
	GPIOX_AFR(5, SPI1_SCK);																		// activo la funcion alternativa del SCK
	GPIOX_AFR(5, SPI1_MOSI);																	// activo la funcion alternativa del MOSI
	GPIOX_AFR(5, SPI1_MISO);																	// activo la funcion alternativa del MISO
	GPIOX_OSPEEDR(MODE_SPD_VHIGH, SPI1_SCK);
	GPIOX_OSPEEDR(MODE_SPD_VHIGH, SPI1_MISO);
	GPIOX_OSPEEDR(MODE_SPD_VHIGH, SPI1_MOSI);

	// 2. Configuramos el SPI
	RCC -> APB2ENR |= RCC_APB2ENR_SPI1EN;														// habilito el reloj del SPI1
	SPI1 -> CR1 = 0;																			// limpiamos el CR1
	SPI1 -> CR1 |= SPI_CR1_BR_0;																// configuro el baudrate a fclk / 2
	SPI1 -> CR1 &=~ SPI_CR1_CPHA | SPI_CR1_CPOL;												// configuro el modo 0
	SPI1 -> CR1 &=~ SPI_CR1_DFF;																// longitud de la trama: 8 bits
	SPI1 -> CR1 &=~ SPI_CR1_LSBFIRST;															// configuro MSB

	// 3. Configuramos el manejo del pin NSS
	SPI1 -> CR1 |= SPI_CR1_SSM;																	// manejo por software
	SPI1 -> CR1 |= SPI_CR1_SSI;																	// ok master
	SPI1 -> CR1 |= SPI_CR1_MSTR;																// habilito el modo master
	SPI1 -> CR1 |= SPI_CR1_SPE;																	// habilita el SPI
}

void SPI1_Write(uint8_t b){
	uint8_t temp;

	while(!(SPI1 -> SR & SPI_SR_TXE));				//espero que el buffer de transmisión este vacio
	*((__IO uint8_t *) &SPI1 -> DR) = b;													//envio un casteo para que solo se asignan los primeros 8 bits al registro de datos
	while(!(SPI1 -> SR & SPI_SR_RXNE));				//espero que se reciba
	temp = SPI1 -> DR;
	(void) temp;
	return;
}

uint8_t SPI1_Read(void){
	while(!(SPI1 -> SR & SPI_SR_TXE));				//espero que el buffer de transmisión este vacio
	*((__IO uint8_t *) &SPI1 -> DR) = 0xFF;													//enviamos bits basura para que el esclavo genera su señal de reloj
	while(!(SPI1 -> SR & SPI_SR_RXNE));					//espero que se reciba
	return (uint8_t) SPI1 -> DR;
}
